; domain
(define (domain emergency-services)
  (:requirements :strips :typing)
  (:types 
    location person drone crate content arm
  ) 

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)
    (hand-empty ?d - drone ?a - arm)
    (holding ?d - drone ?a - arm ?c - crate)
    (crate-content ?c - crate ?cnt - content)
    (has-content ?p - person ?cnt - content)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and (not (at-drone ?d ?from)) (at-drone ?d ?to))
  )

  (:action pick-up
    :parameters (?d - drone ?a - arm ?c - crate ?l - location)
    :precondition (and (at-drone ?d ?l) (at-crate ?c ?l) (hand-empty ?d ?a))
    :effect (and (not (at-crate ?c ?l)) (not (hand-empty ?d ?a)) (holding ?d ?a ?c))
  )

  (:action deliver
    :parameters (?d - drone ?a - arm ?c - crate ?p - person ?l - location ?cnt - content)
    :precondition (and (at-drone ?d ?l) (at-person ?p ?l) (holding ?d ?a ?c) (crate-content ?c ?cnt))
    :effect (and (not (holding ?d ?a ?c)) (hand-empty ?d ?a) (has-content ?p ?cnt))
  )
)

; problem
(define (problem problem_d1_r0_l20_p20_c20_g20)
  (:domain emergency-services)
  (:objects
    drone1 - drone
    depot - location
    loc1 - location
    loc2 - location
    loc3 - location
    loc4 - location
    loc5 - location
    loc6 - location
    loc7 - location
    loc8 - location
    loc9 - location
    loc10 - location
    loc11 - location
    loc12 - location
    loc13 - location
    loc14 - location
    loc15 - location
    loc16 - location
    loc17 - location
    loc18 - location
    loc19 - location
    loc20 - location
    person1 - person
    person2 - person
    person3 - person
    person4 - person
    person5 - person
    person6 - person
    person7 - person
    person8 - person
    person9 - person
    person10 - person
    person11 - person
    person12 - person
    person13 - person
    person14 - person
    person15 - person
    person16 - person
    person17 - person
    person18 - person
    person19 - person
    person20 - person
    crate1 - crate
    crate2 - crate
    crate3 - crate
    crate4 - crate
    crate5 - crate
    crate6 - crate
    crate7 - crate
    crate8 - crate
    crate9 - crate
    crate10 - crate
    crate11 - crate
    crate12 - crate
    crate13 - crate
    crate14 - crate
    crate15 - crate
    crate16 - crate
    crate17 - crate
    crate18 - crate
    crate19 - crate
    crate20 - crate
    food - content
    medicine - content
    left - arm
    right - arm
  )
  (:init
    (at-drone drone1 depot)
    (hand-empty drone1 left)
    (hand-empty drone1 right)
    (at-crate crate1 depot)
    (at-crate crate2 depot)
    (at-crate crate3 depot)
    (at-crate crate4 depot)
    (at-crate crate5 depot)
    (at-crate crate6 depot)
    (at-crate crate7 depot)
    (at-crate crate8 depot)
    (at-crate crate9 depot)
    (at-crate crate10 depot)
    (at-crate crate11 depot)
    (at-crate crate12 depot)
    (at-crate crate13 depot)
    (at-crate crate14 depot)
    (at-crate crate15 depot)
    (at-crate crate16 depot)
    (at-crate crate17 depot)
    (at-crate crate18 depot)
    (at-crate crate19 depot)
    (at-crate crate20 depot)
    (at-person person1 loc19)
    (at-person person2 loc11)
    (at-person person3 loc16)
    (at-person person4 loc13)
    (at-person person5 loc1)
    (at-person person6 loc18)
    (at-person person7 loc18)
    (at-person person8 loc3)
    (at-person person9 loc17)
    (at-person person10 loc3)
    (at-person person11 loc11)
    (at-person person12 loc11)
    (at-person person13 loc4)
    (at-person person14 loc5)
    (at-person person15 loc17)
    (at-person person16 loc11)
    (at-person person17 loc5)
    (at-person person18 loc5)
    (at-person person19 loc2)
    (at-person person20 loc11)
    (crate-content crate1 food)
    (crate-content crate2 food)
    (crate-content crate3 food)
    (crate-content crate4 food)
    (crate-content crate5 food)
    (crate-content crate6 food)
    (crate-content crate7 food)
    (crate-content crate8 food)
    (crate-content crate9 food)
    (crate-content crate10 food)
    (crate-content crate11 food)
    (crate-content crate12 food)
    (crate-content crate13 food)
    (crate-content crate14 food)
    (crate-content crate15 food)
    (crate-content crate16 medicine)
    (crate-content crate17 medicine)
    (crate-content crate18 medicine)
    (crate-content crate19 medicine)
    (crate-content crate20 medicine)
  )
  (:goal (and
    (has-content person1 food)
    (has-content person2 food)
    (has-content person2 medicine)
    (has-content person3 food)
    (has-content person5 food)
    (has-content person6 food)
    (has-content person7 food)
    (has-content person7 medicine)
    (has-content person9 food)
    (has-content person10 food)
    (has-content person12 food)
    (has-content person13 food)
    (has-content person15 food)
    (has-content person16 food)
    (has-content person16 medicine)
    (has-content person17 food)
    (has-content person17 medicine)
    (has-content person18 food)
    (has-content person18 medicine)
    (has-content person20 food)
  ))
)

; plan
1. (pick-up drone1 right crate16 depot)
   deleted: (at-crate crate16 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate16)
   goals met: 0 of 20
2. (pick-up drone1 left crate1 depot)
   deleted: (at-crate crate1 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate1)
   goals met: 0 of 20
3. (fly drone1 depot loc19)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc19)
   goals met: 0 of 20
4. (deliver drone1 left crate1 person1 loc19 food)
   deleted: (holding drone1 left crate1)
   added: (hand-empty drone1 left) (has-content person1 food)
   goals met: 1 of 20
5. (fly drone1 loc19 depot)
   deleted: (at-drone drone1 loc19)
   added: (at-drone drone1 depot)
   goals met: 1 of 20
6. (pick-up drone1 left crate2 depot)
   deleted: (at-crate crate2 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate2)
   goals met: 1 of 20
7. (fly drone1 depot loc16)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc16)
   goals met: 1 of 20
8. (deliver drone1 left crate2 person3 loc16 food)
   deleted: (holding drone1 left crate2)
   added: (hand-empty drone1 left) (has-content person3 food)
   goals met: 2 of 20
9. (fly drone1 loc16 depot)
   deleted: (at-drone drone1 loc16)
   added: (at-drone drone1 depot)
   goals met: 2 of 20
10. (pick-up drone1 left crate3 depot)
   deleted: (at-crate crate3 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate3)
   goals met: 2 of 20
11. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 2 of 20
12. (deliver drone1 left crate3 person5 loc1 food)
   deleted: (holding drone1 left crate3)
   added: (hand-empty drone1 left) (has-content person5 food)
   goals met: 3 of 20
13. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 3 of 20
14. (pick-up drone1 left crate4 depot)
   deleted: (at-crate crate4 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate4)
   goals met: 3 of 20
15. (fly drone1 depot loc18)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc18)
   goals met: 3 of 20
16. (fly drone1 loc18 loc3)
   deleted: (at-drone drone1 loc18)
   added: (at-drone drone1 loc3)
   goals met: 3 of 20
17. (deliver drone1 left crate4 person10 loc3 food)
   deleted: (holding drone1 left crate4)
   added: (hand-empty drone1 left) (has-content person10 food)
   goals met: 4 of 20
18. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 4 of 20
19. (pick-up drone1 left crate5 depot)
   deleted: (at-crate crate5 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate5)
   goals met: 4 of 20
20. (fly drone1 depot loc18)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc18)
   goals met: 4 of 20
21. (fly drone1 loc18 loc4)
   deleted: (at-drone drone1 loc18)
   added: (at-drone drone1 loc4)
   goals met: 4 of 20
22. (deliver drone1 left crate5 person13 loc4 food)
   deleted: (holding drone1 left crate5)
   added: (hand-empty drone1 left) (has-content person13 food)
   goals met: 5 of 20
23. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 5 of 20
24. (pick-up drone1 left crate6 depot)
   deleted: (at-crate crate6 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate6)
   goals met: 5 of 20
25. (fly drone1 depot loc18)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc18)
   goals met: 5 of 20
26. (deliver drone1 left crate6 person6 loc18 food)
   deleted: (holding drone1 left crate6)
   added: (hand-empty drone1 left) (has-content person6 food)
   goals met: 6 of 20
27. (fly drone1 loc18 depot)
   deleted: (at-drone drone1 loc18)
   added: (at-drone drone1 depot)
   goals met: 6 of 20
28. (pick-up drone1 left crate7 depot)
   deleted: (at-crate crate7 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate7)
   goals met: 6 of 20
29. (fly drone1 depot loc18)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc18)
   goals met: 6 of 20
30. (deliver drone1 left crate7 person7 loc18 food)
   deleted: (holding drone1 left crate7)
   added: (hand-empty drone1 left) (has-content person7 food)
   goals met: 7 of 20
31. (fly drone1 loc18 depot)
   deleted: (at-drone drone1 loc18)
   added: (at-drone drone1 depot)
   goals met: 7 of 20
32. (pick-up drone1 left crate8 depot)
   deleted: (at-crate crate8 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate8)
   goals met: 7 of 20
33. (fly drone1 depot loc18)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc18)
   goals met: 7 of 20
34. (deliver drone1 right crate16 person7 loc18 medicine)
   deleted: (holding drone1 right crate16)
   added: (hand-empty drone1 right) (has-content person7 medicine)
   goals met: 8 of 20
35. (fly drone1 loc18 depot)
   deleted: (at-drone drone1 loc18)
   added: (at-drone drone1 depot)
   goals met: 8 of 20
36. (pick-up drone1 right crate17 depot)
   deleted: (at-crate crate17 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate17)
   goals met: 8 of 20
37. (fly drone1 depot loc17)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc17)
   goals met: 8 of 20
38. (deliver drone1 left crate8 person9 loc17 food)
   deleted: (holding drone1 left crate8)
   added: (hand-empty drone1 left) (has-content person9 food)
   goals met: 9 of 20
39. (fly drone1 loc17 depot)
   deleted: (at-drone drone1 loc17)
   added: (at-drone drone1 depot)
   goals met: 9 of 20
40. (pick-up drone1 left crate9 depot)
   deleted: (at-crate crate9 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate9)
   goals met: 9 of 20
41. (fly drone1 depot loc17)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc17)
   goals met: 9 of 20
42. (deliver drone1 left crate9 person15 loc17 food)
   deleted: (holding drone1 left crate9)
   added: (hand-empty drone1 left) (has-content person15 food)
   goals met: 10 of 20
43. (fly drone1 loc17 depot)
   deleted: (at-drone drone1 loc17)
   added: (at-drone drone1 depot)
   goals met: 10 of 20
44. (pick-up drone1 left crate10 depot)
   deleted: (at-crate crate10 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate10)
   goals met: 10 of 20
45. (fly drone1 depot loc5)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc5)
   goals met: 10 of 20
46. (deliver drone1 left crate10 person17 loc5 food)
   deleted: (holding drone1 left crate10)
   added: (hand-empty drone1 left) (has-content person17 food)
   goals met: 11 of 20
47. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 11 of 20
48. (pick-up drone1 left crate11 depot)
   deleted: (at-crate crate11 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate11)
   goals met: 11 of 20
49. (fly drone1 depot loc5)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc5)
   goals met: 11 of 20
50. (deliver drone1 right crate17 person17 loc5 medicine)
   deleted: (holding drone1 right crate17)
   added: (hand-empty drone1 right) (has-content person17 medicine)
   goals met: 12 of 20
51. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 12 of 20
52. (pick-up drone1 right crate18 depot)
   deleted: (at-crate crate18 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate18)
   goals met: 12 of 20
53. (fly drone1 depot loc5)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc5)
   goals met: 12 of 20
54. (deliver drone1 left crate11 person18 loc5 food)
   deleted: (holding drone1 left crate11)
   added: (hand-empty drone1 left) (has-content person18 food)
   goals met: 13 of 20
55. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 13 of 20
56. (pick-up drone1 left crate12 depot)
   deleted: (at-crate crate12 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate12)
   goals met: 13 of 20
57. (fly drone1 depot loc5)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc5)
   goals met: 13 of 20
58. (deliver drone1 right crate18 person18 loc5 medicine)
   deleted: (holding drone1 right crate18)
   added: (hand-empty drone1 right) (has-content person18 medicine)
   goals met: 14 of 20
59. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 14 of 20
60. (pick-up drone1 right crate19 depot)
   deleted: (at-crate crate19 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate19)
   goals met: 14 of 20
61. (fly drone1 depot loc11)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc11)
   goals met: 14 of 20
62. (deliver drone1 left crate12 person2 loc11 food)
   deleted: (holding drone1 left crate12)
   added: (hand-empty drone1 left) (has-content person2 food)
   goals met: 15 of 20
63. (fly drone1 loc11 depot)
   deleted: (at-drone drone1 loc11)
   added: (at-drone drone1 depot)
   goals met: 15 of 20
64. (pick-up drone1 left crate13 depot)
   deleted: (at-crate crate13 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate13)
   goals met: 15 of 20
65. (fly drone1 depot loc11)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc11)
   goals met: 15 of 20
66. (deliver drone1 right crate19 person2 loc11 medicine)
   deleted: (holding drone1 right crate19)
   added: (hand-empty drone1 right) (has-content person2 medicine)
   goals met: 16 of 20
67. (fly drone1 loc11 depot)
   deleted: (at-drone drone1 loc11)
   added: (at-drone drone1 depot)
   goals met: 16 of 20
68. (pick-up drone1 right crate20 depot)
   deleted: (at-crate crate20 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate20)
   goals met: 16 of 20
69. (fly drone1 depot loc11)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc11)
   goals met: 16 of 20
70. (deliver drone1 right crate20 person16 loc11 medicine)
   deleted: (holding drone1 right crate20)
   added: (hand-empty drone1 right) (has-content person16 medicine)
   goals met: 17 of 20
71. (deliver drone1 left crate13 person12 loc11 food)
   deleted: (holding drone1 left crate13)
   added: (hand-empty drone1 left) (has-content person12 food)
   goals met: 18 of 20
72. (fly drone1 loc11 depot)
   deleted: (at-drone drone1 loc11)
   added: (at-drone drone1 depot)
   goals met: 18 of 20
73. (pick-up drone1 right crate14 depot)
   deleted: (at-crate crate14 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate14)
   goals met: 18 of 20
74. (fly drone1 depot loc11)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc11)
   goals met: 18 of 20
75. (deliver drone1 right crate14 person16 loc11 food)
   deleted: (holding drone1 right crate14)
   added: (hand-empty drone1 right) (has-content person16 food)
   goals met: 19 of 20
76. (fly drone1 loc11 depot)
   deleted: (at-drone drone1 loc11)
   added: (at-drone drone1 depot)
   goals met: 19 of 20
77. (pick-up drone1 right crate15 depot)
   deleted: (at-crate crate15 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate15)
   goals met: 19 of 20
78. (fly drone1 depot loc11)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc11)
   goals met: 19 of 20
79. (deliver drone1 right crate15 person20 loc11 food)
   deleted: (holding drone1 right crate15)
   added: (hand-empty drone1 right) (has-content person20 food)
   goals met: 20 of 20
